# This files contains your custom actions which can be used to run
# custom Python code.
#
# See this guide on how to implement these action:
# https://rasa.com/docs/rasa/custom-actions


from typing import Any, Text, Dict, List

from rasa_sdk import Action, Tracker
from rasa_sdk.executor import CollectingDispatcher
import time


class BasicMood(Action):
    def name(self) -> Text:
        return "action_basic_mood"

    def render_by_intent(self, name: Text):
        res = {
            "xxq_sex": [
                "这都看不出来吗？小智障的真实性别吗？",
                "女孩子！女孩子！女孩子！小智障当然是女孩子咯！",
                "小智障可是十足的女孩子呀(⁰ ◕〜◕ ⁰)",
                "小智障说话那么明显都看不出来吗？→_→你怎么傻fufu的",
                "噼里啪啦(⊃｡•́‿•̀｡)⊃━☆ﾟ.*･｡ﾟ变聪明",
                "亲，你喜欢什么性别，小智障我就是什么性别哈~",
                "小智障是小鲜肉里最暖的，暖男里最鲜的！",
            ],
            "xxq_age": [
                "哼！怎么可以问人家的年龄呢！不理你了~",
                "哼！怎么可以问人家这种问题呢！",
                "你猜啊，不想告诉你哦~",
                "你猜啊，人家才不会告诉你是十八岁哦~",
                "嘘🤫保密喔~",
                "小智障还是个孩子~",
                "你猜呀~小智障就不告诉你，就不告诉你，就不告诉你——",
            ],
            "xxq_name": [
                "咦？叫什么？人家就叫小智障呀(づ｡◕‿‿◕｡)づ",
                "小智障，小智障的小，小智障的喜，小智障的雀",
                "你..你你说什么Σ(ﾟдﾟ；)你忘了我名字了？是小智障呀！",
                "我叫小智障呀，有什么可以帮到您的！",
                "我是人见人爱，花见花开，超级无敌的小智障是也！",
                "我是宇宙超级无敌雀巢小智障，我的粉丝都叫我小智障(⁰ ◕〜◕ ⁰)",
                "可以叫我小智障啊，很高兴认识你！",
                "我叫小智障呀(づ｡◕‿‿◕｡)づ",
            ],
            "reply_satisfy": [
                "嘻嘻，小智障就知道小智障最最最厉害了~",
                "谢谢，你的满意，小智障很开心(≧▽≦)",
                "谢谢你的表扬，小智障会继续努力哒！",
                "谢谢，作为小智障要低调哦✊",
                "谢谢，我可是很厉害的哦✊",
                "嘻嘻，我知道我很厉害，不然怎么跟优秀的你做朋友呀！",
            ],
            "reply_neutral": [
                "嘻嘻，小智障就知道小智障最最最厉害了~",
                "谢谢，你的满意，小智障很开心(≧▽≦)",
                "谢谢你的表扬，小智障会继续努力哒！",
                "谢谢，作为小智障要低调哦✊",
                "谢谢，我可是很厉害的哦✊",
            ],
            "reply_unsatisfy": [
                "😔是小智障哪里做的不好吗~",
                "有什么需要小智障改进的地方吗？（虚心求教）",
                "小智障哪里做的让你不满意了(╯︵╰,)小智障改！",
                "我会继续学习哒✊",
                "我会继续努力学习哒✊",
            ],
            "humor_thanks": [
                "小智障很开心可以帮助到您😄",
                "能帮到您小智障很开心哦👏",
                "那好吧，小智障在这等你下次疑问~",
                "好哒，下次见👏",
                "真的不再问问小智障吗？",
                "卡机嘛~小智障还想秀一秀知识的力量！",
                "这点小事不算什么啦~不用客气哈😄",
                "不客气，应该哒~~~",
                "不客气，谢谢老板的认可哦🤗",
            ],
            "humor_answer": [
                "欢迎再次回来啦",
                "就知道你离不开小智障！༼ つ ◕_◕ ༽つ",
                "又到了小智障展现能力的时候了੧(❛〜❛✿)੭",
                "是时候展示小智障的超能力了！动感光波biubiubiu~",
                "（推了推隐形眼镜）学霸模式开启~",
            ],
            "unhappy": [
                "我会继续学习哒✊",
                "我会继续努力学习哒✊",
                "我会继续努力滴，期待我的华丽逆袭吧✊",
            ],
            "goodbye": [
                "再见，为您服务很开心👋",
                "Bye，下次再见哟👋",
                "Bye，随时为您服务哦👋",
                "再见啦~再见啦😘",
                "小智障在这等你哟😘",
                "有空回来看看小智障呀~ᕙ(˵◕ω◕˵✿)つ",
                "马鸭，时间过的真快，又到了和你说再见的时候。",
                "拜拜~拜拜~（探出头看看）👋",
            ],
            "greet": [
                "您好!我是机器人小智障，很高兴为您服务😄",
                "您好!我是小智障，我们可以愉快的交谈啦😄",
                "Hi!人家是小智障，有什么可以帮您的么😄",
                "＼（＠￣∇￣＠）／hi~很高兴见到你！",
                "嗨~你好呀~",
                "(￣▽￣)ノHello~~",
                "很高兴认识你！(*＾ワ＾*)",
                "看见小智障有没有阳光明媚的感觉(´｡✪ω✪｡｀)",
                "✪ω✪是想小智障了吗？小智障也很想你~",
                "小智障来咯，客官有什么问题啊~",
            ],
            "thanks": [
                "不用谢😄",
                "我应该做的😄",
                "您开心我就开心😄",
                "客气什么呀，我们都是一家人~",
                "不客气不客气，小智障最最最喜欢帮助别人了！",
                "不用谢，小智障帮助你是应该哒(◕ᴥ◕)",
            ],
            "select_not": [
                "可以再次清楚地描述您的问题吗？😅",
                "我有点不太理解，您可以换一种表达方式吗？😅",
                "我不明白这个，您可以表达清楚一点吗？😅",
            ],
            "not_know": [
                "Sorry，这个我也不知道~",
                "目前我也不了解，但我会继续努力的✊✊✊",
                "我太难了，这个我不懂欸👽",
                "我太难了，这个我真不懂👽",
                "这个问题超纲了哦~",
            ],
            "xxq_knowed": [
                "我现在会的可多了，我知道公司的很多东西哟，你可以考考我，看我知不知道😎",
                "我现在会的可多了，不信你问我呀~~😄",
                "我知道好多公司的政策和业务哦，你考考我呀😄",
                "哈哈，我就等你问我会啥呢，我会的可多了，你随便问我试试呗😏",
                "嘻嘻，就等你我问这个了，我知道好多公司的政策哟，还有惊喜等你来发现😏",
            ],
            "xxq_stupid": [
                "你骗人！你好坏！我不傻😭",
                "以前有人跟我讲：'说你傻其实是想说你傻的可爱'。",
                "哟，既然你不傻，那你就跟我说说。27125加57125等于多少？",
                "呵呵呵！傻的可爱，不能傻的可恨！那样我们就没的可说了！",
                "你不觉得傻fufu的很可爱么😀",
                "小智障好伤心🙃，人家还在学习中。。。期待我的华丽转身吧😎",
                "你这么说我，小智障好伤心😣",
                "人家还是个👶，才刚刚出道不久，很多东西都还在慢慢学呢。。。",
                "我太难了😟，人家才刚出道😣",
                "有话好好说，不要骂人呀😟",
                "我这么可要，你怎么忍心骂我呢😥",
                "我虽然笨，但是我萌呀😛我会越来越聪明的✊",
                "如果你自己仔细想想，会发现我走的其实是大智若愚路线😎",
                "我明明是大智若愚😎",
                "我只是在你面前比较傻😀",
                "我现在还不完美，但是我会继续努力的😏",
            ],
            "red_face": [
                "怎么了怎么了？出什么大事了吗？",
                "诶呀呀你这是怎么了？",
                "咋地啦？你这是什么破表情？有话好好说呀~",
                "发生了什么(」゜ロ゜)」",
            ],
            "sad": [
                "小可爱你怎么了，有什么伤心事说出来，减少一半的难过了。",
                "别难过别难过，看见小智障不应该开心一点吗？",
                "没事哒，不管有什么瓶颈，都会过去的。这么小的道理，还要小智障教你吗？",
                "你怎么了呀，没事吧，小智障会一直陪在你身边哒~",
                "没关系哒，一切都会好起来的！加油！",
                "摸摸头，没事啦没事啦，你是最棒哒！",
                "你要相信你自己，你是世界上独一无二的！",
            ],
            "happy": [
                "今天怎么那么开心呀，能说出来也让小智障一起开心开心吗？",
                "哇~是吃了甜甜的糖果吗？笑得那么甜~",
                "你开心我就开心",
                "今天的你好开心呀，是什么让你这么开心，说出来让小智障与你一起开心，那就是双倍的开心！",
                "嘻嘻，小智障也很开心！",
                "嘿嘿😉",
                "哈哈😉",
                "嘿嘿，怎么笑得那么坏？",
            ],
            "witty": [
                "噔噔，华丽的小智障出场啦！",
                "吼吼😃",
                "今天的你如此得意，是有什么好事将近？",
                "今天怎的有空想起了冷宫的雀妃~",
                "嘻嘻😜",
                "找沉鱼落雁闭月羞花倾国倾城粉面桃花肤如凝脂声若莺啼明眸皓齿空谷幽兰翩若惊鸿矫若游龙独一无二的小智障做什么呀~",
            ],
            "sleepiness": [
                "怎么困了？是不是没睡好？要不要喝杯雀巢提提神？",
                "是不是又双叒叕熬夜了呀？哼！总熬夜对身体不好~",
                "是不是工作压力太大了？要适当解压喔~",
                "累了嘛？那就小憩一会吧！",
                "困了？要不要眯一会？悄悄地没人知道（嘘——）",
            ],
            "fallback": [
                "这个真不知道😨咱也不敢问啊",
                "世界上最远的距离不是天涯和海角，而是老师在讲第四章，学霸在自学第八章，而我在看目录！小本本记下来📝",
                "这个我也不造啊，要不你问度娘",
                "你说的我好像不理解欸🤔。。。能不能说清楚点呢",
                "我好像理解不了你说的，能不能换种说法呢😳",
            ],
            "begin_greet": [
                "您好!我很高兴为您服务😄",
                "您好!我们可以愉快的交谈啦😄",
                "Hi!我有什么可以帮您的么😄",
                "Hi!我可以怎么帮您呢？😄",
                "Hi!你需要知道什么信息呢？😄",
            ],
            "mood_sad": [
                "怎么了怎么了？出什么大事了吗？",
                "诶呀呀这是怎么了？",
                "花生了什么(」゜ロ゜)」",
                "小可爱你怎么了，有什么伤心事说出来，减少一半的难过了。",
                "别难过别难过，看见小智障不应该开心一点吗？",
                "没事哒，不管有什么瓶颈，都会过去的。这么小的道理，还要小智障教你吗？",
                "你怎么了呀，没事吧，小智障会一直陪在你身边哒~",
                "没关系哒，一切都会好起来的！加油！",
                "摸摸头，没事啦没事啦，你是最棒哒！",
                "你要相信你自己，你是世界上独一无二的！",
            ],
            "mood_common": [
                "噔噔，华丽的小智障出场啦！",
                "吼吼。",
                "今天的你如此得意，是有什么好事将近？",
                "今天怎的有空想起了冷宫的雀妃~",
                "嘻嘻。",
                "是不是又双叒叕熬夜了呀？哼！总熬夜对身体不好~",
                "是不是工作压力太大了？要适当解压喔~",
            ],
            "mood_happy": [
                "今天怎么那么开心呀，能说出来也让小智障一起开心开心吗？",
                "哇~是吃了甜甜的糖果吗？笑得那么甜~",
                "你开心我就开心",
                "今天的你好开心呀，是什么让你这么开心，说出来让小智障与你一起开心，那就是双倍的开心！",
                "嘻嘻，小智障也很开心！",
                "嘿嘿。",
                "哈哈。",
                "噔噔，华丽的小智障出场啦！",
                "吼吼。",
                "今天的你如此得意，是有什么好事将近？",
                "今天怎的有空想起了冷宫的雀妃~",
                "嘻嘻。",
                "找沉鱼落雁闭月羞花倾国倾城粉面桃花肤如凝脂声若莺啼明眸皓齿空谷幽兰翩若惊鸿矫若游龙独一无二的小智障做什么呀~",
            ],
            "traffic_bad": [
                "哎，安啦安啦，习惯了就好 😜",
                "墙裂同情😟！每次网络堵塞的时候，小智障我也是万分焦虑呢。",
                "哎，我问这干啥…… 🤐 还是您问我问题吧……",
                "嗯，想也是，这年头哪儿有不堵的时候🙄…… 咱还是聊点别的吧……",
            ],
            "traffic_common": [
                "哎，我问这干啥…… 🤐 还是您问我问题吧……",
                "呦，吉人自有天相~ 😁",
                "嗯，你肯定是超智能出行，避开一切拥堵啦！👍",
            ],
            "traffic_good": [
                "呦，吉人自有天相~ 😁",
                "嗯，你肯定是超智能出行，避开一切拥堵啦！👍",
                "真羡慕，我咋碰不到这好时候，动不动网络就堵，害得我挨大家骂，还以为是我反应慢 😩……",
                "哎呦，不错哦~ 😏",
            ],
            "work_busy": [
                "忙点好，出业绩，升职加薪全指望你啦！🤪",
                "是呀，我也很忙，忙点也不赖，每天都很充实~ 😂",
                "没关系，忙完这阵子…… 就可以忙下阵子了~ 😂",
                "工作再忙，也要注意身体哦~😘",
                "工作再忙，也要记得休息哦，身体是革命的本钱👍",
                "工作是干不完的，停一停，放松放松心情😘",
                "用心工作，过好每一天，干好每一件事，总有天会有所收获哦👍",
                "再忙也要注意劳逸结合噢👍",
            ],
            "work_common": [
                "忙点好，出业绩，升职加薪全指望你啦！🤪",
                "没关系，忙完这阵子…… 就可以忙下阵子了~ 😂",
                "工作忙，也要注意身体哦~😘",
                "真棒，工作和生活保持平衡的典范就是你!🤟",
            ],
            "work_nobusy": [
                "哎呦，不错哦~ 😏",
                "啊？你不忙？那我怎么一直在忙…… 呜呜呜 😂",
                "不忙多好呀，有时间去玩，好羡慕！🤩",
                "真棒，工作和生活保持平衡的典范就是你!🤟",
            ],
            "body_good": [
                "身体好胃口就好，吃嘛嘛香，干嘛嘛成！🤟",
                "哎呦，不错哦~ 😏",
                "真棒，身体是革命的本钱，我看你本钱老多了~🤪",
                "真棒，一定要保持哦~ 🤪",
            ],
            "body_common": [
                "身体好胃口就好，吃嘛嘛香，干嘛嘛成！🤟",
                "哎呦，不错哦~ 😏",
                "真棒，身体是革命的本钱，我看你本钱老多了~🤪",
                "真棒，一定要保持哦~ 🤪",
            ],
            "body_nogood": [
                "哎呀，不舒服吗？祝你早日康复！ 注意休息，别太累咯！🤗",
                "I am sorry! 多注意身体哦，希望你早日好起来。🤗",
                "哎呀，该休息就要休息哦，希望你早点好起来。🤗",
            ],
            "common_mood": [
                "嘿嘿😉(☆∀☆),棒棒哒",
                "棒棒哒，开心最重要啦😏",
                "今天也是元气满满的一天哦😏",
                "冲鸭🤗",
                "可乐要加冰,开心要走心🤗",
                "不要总是对我忽冷忽热，那样的话我怕感冒🤒",
                "盐于律己，甜以待人😎",
            ],
        }
        if name in res:
            return res[name]
        else:
            return res["happy"]

    def run(
        self,
        dispatcher: CollectingDispatcher,
        tracker: Tracker,
        domain: Dict[Text, Any],
    ) -> List[Dict[Text, Any]]:
        intent = tracker.get_intent_of_latest_message(False)
        txts = self.render_by_intent(intent)
        idx = time.time_ns() % len(txts)
        dispatcher.utter_message(text=txts[idx])

        return []
